# RenderingSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RenderingSettings Methods
RenderingSettings Class See Also
---
The RenderingSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBackgroundSettings | Returns an object that represents the rendering background settings. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRenderingImageExposureSettings | Returns an object that represents the rendering image exposure settings. |
| GetRenderingQualitySettings | Returns an object that represents the rendering quality settings. |
| GetRenderingRegionOutline | Returns the outline of the rendering region. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetBackgroundSettings | Changes the rendering background settings details for the current background style. |
| SetRenderingImageExposureSettings | Changes the rendering image exposure settings. |
| SetRenderingQualitySettings | Change rendering quality settings. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace